{
  "patient_id": "f79e6973-ca49-4dd0-82fa-ad97daf9b71b",
  "personal_info": {
    "name": "Victor Quaint",
    "dob": "2002-08-08",
    "age": 22,
    "role": "patient"
  },
  "medical_history": {},
  "prescriptions": [
    {
      "id": "8d1f8cff-bfd7-4b17-921e-0f4cd638e2b6",
      "medication": "Oseltamivir Phosphate",
      "dosage": "2 DOSAGE AND ADMINISTRATION Treatment of influenza Adults and adolescents (13 years and older): 75 mg twice daily for 5 days ( 2.2 ) Pediatric patients 1 to 12 years of age: Based on weight twice daily for 5 days ( 2.2 ) Pediatric patients 2 weeks to less than 1 year of age: 3mg/kg twice daily for 5 days ( 2.2 ) Renally impaired adult patients (creatinine clearance >30-60 mL/min): Reduce to 30 mg twice daily for 5 days ( 2.4 ) Renally impaired adult patients (creatinine clearance >10-30 mL/min): Reduce to 30 mg once daily for 5 days ( 2.4 ) ESRD patients on hemodialysis: Reduce to 30 mg immediately and then 30 mg after every hemodialysis cycle. Treatment duration not to exceed 5 days ( 2.4 ) ESRD patients on CAPD: Reduce to a single 30 mg dose immediately ( 2.4 ) Prophylaxis of influenza Adults and adolescents (13 years and older): 75 mg once daily for at least 10 days ( 2.3 ) Community outbreak: 75 mg once daily for up to 6 weeks ( 2.3 ) Pediatric patients 1 to 12 years of age: Based on weight once daily for 10 days ( 2.3 ) Community outbreak: Based on weight once daily for up to 6 weeks ( 2.3 ) Renally impaired adult patients (creatinine clearance >30-60 mL/min): Reduce to 30 mg once daily ( 2.4 ) Renally impaired adult patients (creatinine clearance >10-30 mL/min): Reduce to 30 mg once every other day ( 2.4 ) ESRD patients on hemodialysis: Reduce to 30 mg immediately and then 30 mg after alternate hemodialysis cycles for the recommended duration of prophylaxis ( 2.4 ) ESRD patients on CAPD: Reduce to 30 mg immediately and then 30 mg once weekly for the recommended duration of prophylaxis ( 2.4 ) 2.1 Dosage and Administration Overview Administer oseltamivir phosphate capsules for the treatment of influenza in patients 2 weeks of age or older [see Dosage and Administration (2.2) ] or for prophylaxis of influenza in patients 1 year and older [see Dosage and Administration (2.3) ] . The capsules may be taken with or without food; however, tolerability may be enhanced if oseltamivir phosphate capsules are taken with food. Adjust the oseltamivir phosphate capsules dosage in patients with moderate or severe renal impairment [see Dosage and Administration (2.4) ]. For patients who cannot swallow capsules, oseltamivir phosphate for oral suspension is the preferred formulation. When oseltamivir phosphate for oral suspension is not available from wholesaler or the manufacturer, oseltamivir phosphate capsules may be opened and mixed with sweetened liquids such as regular or sugar-free chocolate syrup, corn syrup, caramel topping, or light brown sugar (dissolved in water). During emergency situations and when neither the oral suspension or the age-appropriate strengths of oseltamivir phosphate capsules to mix with sweetened liquids are available, then a pharmacist may prepare an emergency supply of oral suspension from oseltamivir phosphate 75 mg capsules [see Dosage and Administration (2.6) ]. 2.2 Recommended Dosage for Treatment of Influenza Initiate treatment with oseltamivir phosphate capsules within 48 hours of influenza symptom onset. Adults and Adolescents (13 years of age and older) The recommended oral dosage of oseltamivir phosphate capsules for treatment of influenza in adults and adolescents 13 years and older is 75 mg twice daily (one 75 mg capsule or 12.5 mL of oral suspension twice daily) for 5 days. Pediatric Patients (2 weeks of age through 12 years of age) Table 1 displays the recommended oral dosage of oseltamivir phosphate capsules for treatment of influenza in pediatric patients 2 weeks of age through 12 years of age and provides information about prescribing the capsule or the formulation for oral suspension. 2.3 Recommended Dosage for Prophylaxis of Influenza Initiate post-exposure prophylaxis with oseltamivir phosphate capsules within 48 hours following close contact with an infected individual. Initiate seasonal prophylaxis with oseltamivir phosphate capsules during a community outbreak. Adults and Adolescents (13 years of age and older) The recommended dosage of oseltamivir phosphate capsules for prophylaxis of influenza in adults and adolescents 13 years and older is 75 mg orally once daily (one 75 mg capsule or 12.5 mL of oral suspension once daily) for at least 10 days following close contact with an infected individual and up to 6 weeks during a community outbreak. In immunocompromised patients, oseltamivir phosphate capsules may be continued for up to 12 weeks [see Use in Specific Populations (8.9) ] . The duration of protection lasts for as long as oseltamivir phosphate capsules dosing is continued. Pediatric Patients (1 year to 12 years of age) Table 1 displays the recommended oral dosage of oseltamivir phosphate capsules for prophylaxis of influenza in pediatric patients 1 year to 12 years of age based on body weight and provides information about prescribing the capsule or the formulation for oral suspension. Prophylaxis in pediatric patients is recommended for 10 days following close contact with an infected individual and up to 6 weeks during a community outbreak [see Use in Specific Populations (8.4) and Clinical Studies (14.2) ] . Table 1 Oseltamivir Phosphate Capsules Dosage Recommendations in Pediatric Patients for Treatment and Prophylaxis of Influenza Weight Treatment Dosage for 5 days Prophylaxis Dosage for 10 days The recommended duration for post-exposure prophylaxis is 10 days and the recommended duration for community outbreak (seasonal/pre-exposure) prophylaxis is up to 6 weeks (or up to 12 weeks in immunocompromised patients). The amount supplied (e.g., number of bottles or capsules) for seasonal prophylaxis may be greater than for post-exposure prophylaxis.Use an oral dosing dispensing device that measures the appropriate volume in mL with the oral suspension. Oseltamivir phosphate for oral suspension is the preferred formulation for patients who cannot swallow capsules.For patients less than 1 year of age, provide an appropriate dosing device that can accurately measure and administer small volumes. Volume of Oral Suspension (6 mg/mL) for each Dose Use an oral dosing dispensing device that measures the appropriate volume in mL with the oral suspension. Number of Bottles of Oral Suspension to Dispense Number of Capsules to Dispense (Strength) Oseltamivir phosphate for oral suspension is the preferred formulation for patients who cannot swallow capsules. Patients from 2 Weeks to less than 1 Year of Age Any weight 3 mg/kg twice daily Not applicable 0.5 mL/kg For patients less than 1 year of age, provide an appropriate dosing device that can accurately measure and administer small volumes. 1 bottle Not applicable Patients 1 to 12 Years of Age Based on Body Weight 15 kg or less 30 mg twice daily 30 mg once daily 5 mL 1 bottle 10 capsules (30 mg) 15.1 kg to 23 kg 45 mg twice daily 45 mg once daily 7.5 mL 2 bottles 10 capsules (45 mg) 23.1 kg to 40 kg 60 mg twice daily 60 mg once daily 10 mL 2 bottles 20 capsules (30 mg) 40.1 kg or more 75 mg twice daily 75 mg once daily 12.5 mL 3 bottles 10 capsules (75 mg) 2.4 Dosage in Patients with Renal Impairment Table 2 displays the dosage recommendations for the treatment and prophylaxis of influenza in adults with various stages of renal impairment (estimated creatinine clearance of less than or equal to 90 mL per minute). Dosage modifications are recommended in adults with an estimated creatinine clearance less than or equal to 60 mL per minute [see Use in Specific Population (8.6) and Clinical Pharmacology (12.3) ] . Table 2 Recommended Dosage Modifications for Treatment and Prophylaxis of Influenza in Adults with Renal Impairment or End Stage Renal Disease (ESRD) on Dialysis Renal Impairment (Creatinine Clearance) Recommended Treatment Regimen Capsules or oral suspension can be used for 30 mg dosing. Recommended Prophylaxis Regimen The recommended duration for post-exposure prophylaxis is at least 10 days and the recommended duration for community outbreak (seasonal/pre-exposure) prophylaxis is up to 6 weeks (or up to 12 weeks in immunocompromised patients).Data derived from studies in continuous ambulatory peritoneal dialysis (CAPD) patients. Mild (>60-90 mL/minute) 75 mg twice daily for 5 days 75 mg once daily Moderate (>30-60 mL/minute) 30 mg twice daily for 5 days 30 mg once daily Severe (>10-30 mL/minute) 30 mg once daily for 5 days 30 mg every other day ESRD Patients on Hemodialysis (≤ 10 mL/minute) 30 mg immediately and then 30 mg after every hemodialysis cycle (treatment duration not to exceed 5 days) 30 mg immediately and then 30 mg after alternate hemodialysis cycles ESRD Patients on Continuous Ambulatory Peritoneal Dialysis Data derived from studies in continuous ambulatory peritoneal dialysis (CAPD) patients. (≤10 mL/minute) A single 30 mg dose administered immediately 30 mg immediately and then 30 mg once weekly ESRD Patients not on Dialysis Oseltamivir phosphate capsules are not recommended Oseltamivir phosphate capsules are not recommended 2.6 Emergency Preparation of Oral Suspension from 75 mg Oseltamivir Phosphate Capsules The following directions are provided for use only during emergency situations and when FDA-approved, commercially manufactured oseltamivir phosphate for oral suspension is not available from wholesalers or the manufacturer. The following emergency preparation instructions will provide one patient with enough oseltamivir phosphate capsules for a 5-day course of treatment of influenza or a 10-day course of prophylaxis of influenza: Step #1 : Determine the dosage of oseltamivir phosphate capsules for the patient [see Dosage and Administration (2.2 , 2.3 , and 2.4) ] then determine the total volume of oral suspension needed to be prepared (see Table 3 ). Table 3 Emergency Preparation: Volume of Prepared Oral Suspension (6 mg per mL) Based Upon Oseltamivir Phosphate Capsules Dose Oseltamivir Phosphate Capsules Dose If the oseltamivir phosphate capsules dose is between the doses listed, use the greater listed dose to determine the total volume of prepared oral suspension. Total Volume to Prepare per Patient 15 mg or less 37.5 mL 30 mg 75 mL 45 mg 100 mL 60 mg 125 mL 75 mg 150 mL Step #2 : Preparation must be performed with only one of the following vehicles (other vehicles have not been studied): Cherry Syrup (Humco ® ), Ora-Sweet ® SF (sugar-free) (Paddock Laboratories), or simple syrup. Determine the number of capsules and the amount of water and vehicle needed to prepare the total volume (see Table 3 ) of prepared oral suspension (6 mg per mL) for a complete treatment or prophylaxis course (see Table 4 ). Table 4 Emergency Preparation: Number of Oseltamivir Phosphate 75 mg Capsules and Amount of Water and Vehicle Needed to Prepare the Total Volume of a Prepared Oral Suspension (6 mg per mL) Total Volume of Prepared Oral Suspension 37.5 mL 75 mL 100 mL 125 mL 150 mL Number of Oseltamivir Phosphate 75 mg Capsules (Total Strength) Includes overage to ensure all doses can be delivered 3 (225 mg) 6 (450 mg) 8 (600 mg) 10 (750 mg) 12 (900 mg) Amount of Water 2.5 mL 5 mL 7 mL 8 mL 10 mL Volume of Vehicle Cherry Syrup (Humco ® ) OR Ora-Sweet ® SF (Paddock Laboratories) OR simple syrup 34.5 mL 69 mL 91 mL 115 mL 137 mL Step #3 : Follow the instructions below for preparing the 75 mg oseltamivir phosphate capsules to produce the oral suspension (6 mg per mL): Place the specified amount of water into a polyethyleneterephthalate (PET) or glass bottle (see Table 4 ). Constitution in other bottle types is not recommended because there is no stability data with other bottle types. Carefully separate the capsule body and cap and pour the contents of the required number of oseltamivir phosphate 75 mg capsules into the PET or glass bottle. Gently swirl the suspension to ensure adequate wetting of the oseltamivir phosphate capsules powder for at least 2 minutes. Slowly add the specified amount of vehicle to the bottle. Close the bottle using a child-resistant cap and shake well for 30 seconds to completely dissolve the active drug and to ensure homogeneous distribution of the dissolved drug in the resulting suspension. The active drug, oseltamivir phosphate, readily dissolves in the specified vehicles. The suspension is caused by inert ingredients of oseltamivir phosphate capsules which are insoluble in these vehicles. Put an ancillary label on the bottle indicating \"Shake Well Before Use.\" Instruct the parent or caregiver that any unused suspension remaining in the bottle following completion of therapy must be discarded by either affixing an ancillary label to the bottle or adding a statement to the pharmacy label instructions. Place a pharmacy label on the bottle that includes the patient\\'s name, dosing instructions, drug name and any other required information to be in compliance with all State and Federal Pharmacy Regulations. Place an appropriate expiration date on the label according to storage conditions below. Include the recommended dosage on the pharmacy label as per Tables 1 and 2 [see Dosage and Administration (2.2 , 2.3 , and 2.4) ]. Store the prepared oral suspension in glass or PET bottles either: In a refrigerator [2° to 8°C (36° to 46°F)]: Stable for 5 weeks when stored in a refrigerator. At room temperature [25°C (77°F)]: Stable for 5 days when stored at room temperature.",
      "frequency": "As prescribed",
      "duration": "As prescribed",
      "quantity": 10,
      "prescribed_at": "2025-06-04T13:38:26.372879",
      "status": "pending"
    },
    {
      "id": "74d0d989-6194-44b0-a879-cd9b187c8df8",
      "medication": "Allopurinol",
      "dosage": "2 DOSAGE AND ADMINISTRATION Gout : Prior to initiating treatment assess serum uric acid level, complete blood count, chemistry panel, liver and kidney function tests. Prophylactic treatment for gout flares is recommended. ( 2.1 , 2.2 ) Patients with normal kidney function: Initial dosage is 100 mg orally daily. Increase by 100 mg weekly increments until serum uric acid of 6 mg/dl or less is reached (maximum 800 mg daily). ( 2.3 ) Patients with impaired kidney function: The initial dosage is 50 mg orally daily. Follow recommendations for titration in patients with renal impairment until target serum uric acid level is reached. ( 2.6 ) See complete information in the Full Prescribing Information (FPI). Hyperuricemia Associated with Cancer Therapy : The recommended dosage is: Adults: 300 mg to 800 mg orally daily. Pediatric patients: 100 mg/m 2 orally every 8 hours to 12 hours (10 mg/kg/day, maximum 800 mg/day) See complete information in the FPI. ( 2.4 , 2.6 ) Recurrent Calcium Oxalate Calculi : The recommended initial dosage in patients with normal kidney function is 200 mg to 300 mg orally daily. ( 2.5 ) Dosage in Patients with Renal Impairment: See FPI for dosage modifications in patients with renal impairment. ( 2.6 ) 2.1 Recommended Testing Prior to Treatment Initiation Prior to initiating treatment with allopurinol tablets in patients with gout, assess the following baseline tests: serum uric acid level, complete blood count, chemistry panel, liver function tests (serum alanine aminotransferase [ALT], aspartate aminotransferase [AST], alkaline phosphatase, and total bilirubin), kidney function tests (serum creatinine and eGFR). 2.2 Recommended Prophylaxis for Gout Flares Gout flares may occur after initiation of allopurinol tablets due to changing serum uric acid levels resulting in mobilization of urate from tissue deposits. Flare prophylaxis with colchicine or an anti- inflammatory agent according to practice guidelines is recommended upon initiation of allopurinol tablets. While adjusting the dosage of allopurinol tablets in patients who are being treated with colchicine and/or anti-inflammatory agents, continue flare prophylaxis drugs until serum uric acid has been normalized and the patient has been free of gout flares for several months. If a gout flare occurs during allopurinol tablets treatment, allopurinol tablets need not be discontinued. Manage the gout flare concurrently, as appropriate for the individual patient [see Warnings and Precautions ( 5.2 )]. 2.3 Recommended Dosage for Gout The initial recommended dosage for the management of gout is 100 mg orally daily, with weekly increments of 100 mg, until a serum uric acid level of 6 mg/dL or less is reached. Initiating treatment with lower dosages of allopurinol tablets and titrating slowly, decreases the risk of gout flares and drug induced serious adverse reactions. In patients with renal impairment the initial dosage is 50 mg orally daily with lower dose increases until serum uric acid level of 6 mg/dL or less is reached. For complete dosage recommendations for patients with renal impairment see Table 1 [see Dosage and Administration ( 2.6 )]. The minimal effective dosage is 100 mg to 200 mg daily and the maximal recommended dosage is 800 mg daily. The appropriate dosage may be administered in divided doses or as a single equivalent dose with the 300 mg tablet. Doses in excess of 300 mg should be administered in divided doses. Monitor patients’ kidney function during the early stages of administration of allopurinol tablets and decrease the dosage or withdraw the drug if persistent abnormalities in kidney function occur [see Dosage and Administration (2.6), Warnings and Precautions (5.3), Use in Specific Populations ( 8.6 )]. The dosage of allopurinol tablets to achieve control of gout varies with the severity of the disease. In general, gout control is achieved with 200 mg to 300 mg daily in patients with mild gout, and with 400 mg to 600 mg daily in patients with moderate to severe tophaceous gout. Gout attacks usually become shorter and less severe after several months of therapy. If a dose of allopurinol tablets is missed, there is no need to double the dose at the next scheduled time. Allopurinol tablets is generally better tolerated if taken following meals. A fluid intake sufficient to yield a daily urinary output of at least 2 liters and the maintenance of a neutral or preferably, slightly alkaline urine are desirable. Inform patients of the possibility of gout flares [see Warnings and Precautions ( 5.2 )]. Instruct them to remain on allopurinol tablets if this occurs and to increase fluid intake during therapy to prevent kidney stones. Concurrent Use of Uricosuric Agents Some patients, may benefit using uricosuric agents concurrently, to reduce serum uric acid to target levels. When transferring a patient from a uricosuric agent to allopurinol tablets, reduce the dose of the uricosuric agent over a period of several weeks and increase the dose of allopurinol tablets gradually to the required dose needed to maintain target serum uric acid level. 2.4 Recommended Dosage for Hyperuricemia Associated with Cancer Therapy Initiate therapy with allopurinol tablets 24 hours to 48 hours before the start of chemotherapy known to cause tumor cell lysis. Administer fluids sufficient to yield a daily urinary output of at least 2 liters in adults (at least 100 mL/m 2 /hour in pediatric patients) with a neutral or, preferably, slightly alkaline urine. The recommended dosage of allopurinol tablets is: Adult patients – 300 mg to 800 mg orally daily Pediatric patients - 100 mg/m 2 orally every 8 hours to 12 hours (10 mg/kg/day, maximum 800 mg/day). In patients with body surface area < 0.5 m 2 , consider using an alternative allopurinol formulation. The dosage of allopurinol tablets to maintain normal or near-normal serum uric acid varies with the severity of the disease. Monitor serum uric acid levels at least daily and administer allopurinol tablets at a dose and frequency to maintain the serum uric acid within the normal range. Discontinue allopurinol tablets when the risk of tumor lysis has abated (2 days to 3 days from start of chemotherapy). For complete dosage recommendations for patients with renal impairment, see Table 2 [see Dosage and Administration ( 2.6 )] . 2.5 Recommended Dosage for Management of Recurrent Calcium Oxalate Calculi in Hyperuricosuric Patients The recommended dosage for the management of recurrent calcium oxalate stones in hyperuricosuric patients is 200 mg to 300 mg orally daily in divided doses or as the single equivalent. This dose may be adjusted depending upon the resultant control of the hyperuricosuria based upon subsequent 24-hour urinary urate determinations. 2.6 Recommended Dosage in Patients with Renal Impairment The recommended initial dosages of allopurinol tablets in adult patients with renal impairment are shown in Tables 1 and 2 [see Use in Specific Populations ( 8.6 )] . Patients with Gout The recommended initial dosages in adult patients with gout with impaired kidney function are shown in Table 1 [see Use in Specific Populations ( 8.6 )]. Initiate treatment with a lower dose of allopurinol tablets and increase the dose gradually in 50 mg/day increments every 2 weeks to 4 weeks in patients with renal impairment to decrease the risk of drug induced serious adverse reactions. Use the lowest dose possible to achieve the desired effect on serum and/or urine uric acid. Monitor kidney function in gout patients with chronic kidney disease closely when initiating treatment with allopurinol tablets and decrease or withdraw the drug if increased abnormalities in kidney function appear and persist. Table 1. Recommended Initial Dosage in Adult Patients with Gout eGFR Initial Dosage > 60 mL/minute No dosage modification > 30 to 60 mL/minute 50 mg daily > 15 to 30 mL/minute 50 mg every other day 5 to 15 mL/minute 50 mg twice weekly < 5 mL/minute 50 mg once weekly The maximum dosage that should be used in patients with various levels of renal impairment is not defined at different eGFR levels. Patients with Recurrent Calcium Oxalate Calculi Data are insufficient to provide dosage recommendations for the treatment of recurrent calcium oxalate calculi in patients with renal impairment. Allopurinol and its metabolites are excreted by the kidney, and accumulation of the drug can occur in renal failure [see Warnings and Precautions ( 5.3 ) and Use in Specific Populations ( 8.6 )]. Hyperuricemia Associated with Cancer Therapy The recommended dosage of allopurinol tablets for the management of hyperuricemia associated with cancer therapy in adult patients with renal impairment is shown in Table 2 [see Use in Specific Populations ( 8.6 )]. Table 2. Recommended Dosage of Allopurinol Tablets in Adult Patients for Management of Hyperuricemia Associated with Cancer Therapy with Renal Impairment eGFR Recommended Dosage > 20 mL/min to 60 mL/min No dosage modification 10 mL/min to 20 mL/min 200 mg/day < 10 mL/min 100 mg/day On dialysis 50 mg every 12 hours, or 100 mg every 24 hours Treatment with allopurinol tablets has not been studied in pediatric patients with severe renal impairment (eGFR < 20 mL/min) or on dialysis. There is insufficient information to establish dosing for allopurinol tablets in pediatric patients with renal impairment. In these patients, consider the risks and potential benefits before initiating treatment with allopurinol tablets [see Warnings and Precautions ( 5.3 ) and Use in Specific Populations ( 8.6 )] .",
      "frequency": "As prescribed",
      "duration": "As prescribed",
      "quantity": 10,
      "prescribed_at": "2025-06-04T13:38:26.374777",
      "status": "pending"
    },
    {
      "id": "e9274577-a86f-4a03-a572-56780d78c1a1",
      "medication": "Fludrocortisone Acetate",
      "dosage": "\"DOSAGE AND ADMINISTRATION Dosage depends on the severity of the disease and the response of the patient. Patients should be continually monitored for signs that indicate dosage adjustment is necessary, such as remission or exacerbations of the disease and stress (surgery, infection, trauma) (see WARNINGS and PRECAUTIONS, General ). Addison's Disease In Addison's disease, the combination of fludrocortisone acetate tablets with a glucocorticoid such as hydrocortisone or cortisone provides substitution therapy approximating normal adrenal activity with minimal risks of unwanted effects. The usual dose is 0.1 mg of fludrocortisone acetate tablets daily, although dosage ranging from 0.1 mg three times a week to 0.2 mg daily has been employed. In the event transient hypertension develops as a consequence of therapy, the dose should be reduced to 0.05 mg daily. Fludrocortisone acetate tablets are preferably administered in conjunction with cortisone (10 mg to 37.5 mg daily in divided doses) or hydrocortisone (10 mg to 30 mg daily in divided doses). Salt-Losing Adrenogenital Syndrome The recommended dosage for treating the salt-losing adrenogenital syndrome is 0.1 mg to 0.2 mg of fludrocortisone acetate tablets daily.\"",
      "frequency": "As prescribed",
      "duration": "As prescribed",
      "quantity": 10,
      "prescribed_at": "2025-06-04T13:38:26.377532",
      "status": "pending"
    },
    {
      "id": "6a376d4f-e2cf-4147-961c-34b165b23f36",
      "medication": "Oseltamivir Phosphate",
      "dosage": "2 DOSAGE & ADMINISTRATION Treatment of influenza ( 2.2) • Adults and adolescents (13 years and older): 75 mg twice daily for 5 days • Pediatric patients 1 to 12 years of age: Based on weight twice daily for 5 days • Pediatric patients 2 weeks to less than 1 year of age: 3 mg/kg twice daily for 5 days • Renally impaired adult patients (creatinine clearance >30 to 60 mL/min): Reduce to 30 mg twice daily for 5 days (2.4) • Renally impaired adult patients (creatinine clearance >10 to 30 mL/min): Reduce to 30 mg once daily for 5 days (2.4) • ESRD patients on hemodialysis: Reduce to 30 mg immediately and then 30 mg after every hemodialysis cycle. Treatment duration not to exceed 5 days (2.4) • ESRD patients on CAPD: Reduce to a single 30 mg dose immediately (2.4) Prophylaxis of influenza (2.3) • Adults and adolescents (13 years and older): 75 mg once daily for at least 10 days - Community outbreak: 75 mg once daily for up to 6 weeks • Pediatric patients 1 to 12 years of age: Based on weight once daily for 10 days - Community outbreak: Based on weight once daily for up to 6 weeks • Renally impaired adult patients (creatinine clearance >30 to 60 mL/min): Reduce to 30 mg once daily (2.4) • Renally impaired adult patients (creatinine clearance >10 to 30 mL/min): Reduce to 30 mg once every other day (2.4) • ESRD patients on hemodialysis: Reduce to 30 mg immediately and then 30 mg after alternate hemodialysis cycles for the recommended duration of prophylaxis (2.4) • ESRD patients on CAPD: Reduce to 30 mg immediately and then 30 mg once weekly for the recommended duration of prophylaxis (2.4 ) 2.1 Dosage and Administration Overview Administer oseltamivir phosphate capsules for the treatment of influenza in patients 2 weeks of age or older [see Dosage and Administration ( 2.2)] or for prophylaxis of influenza in patients 1 year and older [see Dosage and Administration (2.3)] using: • Oseltamivir phosphate capsules The capsules may be taken with or without food; however, tolerability may be enhanced if oseltamivir phosphate capsule are taken with food. Adjust the oseltamivir phosphate capsules dosage in patients with moderate or severe renal impairment [see Dosage and Administration (2.4)]. For patients who cannot swallow capsules, oseltamivir phosphate for oral suspension is the preferred formulation. When oseltamivir phosphate for oral suspension is not available from wholesaler or the manufacturer, oseltamivir phosphate capsules may be opened and mixed with sweetened liquids such as regular or sugar-free chocolate syrup, corn syrup, caramel topping, or light brown sugar (dissolved in water). During emergency situations and when neither the oral suspension or the age-appropriate strengths of oseltamivir phosphate capsules to mix with sweetened liquids are available, then a pharmacist may prepare an emergency supply of oral suspension from oseltamivir phosphate 75 mg capsules [ see Dosage and Administration ( 2.6)]. 2.2 Recommended Dosage for Treatment of Influenza Initiate treatment with oseltamivir phosphate capsules within 48 hours of influenza symptom onset. Adults and Adolescents (13 years of age and older) The recommended oral dosage of oseltamivir phosphate capsules for treatment of influenza in adults and adolescents 13 years and older is 75 mg twice daily (one 75 mg capsule twice daily) for 5 days. Pediatric Patients (2 weeks of age through 12 years of age) Table 1 displays the recommended oral dosage of oseltamivir phosphate capsules for treatment of influenza in pediatric patients 2 weeks of age through 12 years of age and provides information about prescribing the capsule or the formulation for oral suspension. 2.3 Recommended Dosage for Prophylaxis of Influenza Initiate post-exposure prophylaxis with oseltamivir phosphate capsules within 48 hours following close contact with an infected individual. Initiate seasonal prophylaxis with oseltamivir phosphate capsules during a community outbreak. Adults and Adolescents (13 years of age and older) The recommended dosage of oseltamivir phosphate capsules for prophylaxis of influenza in adults and adolescents 13 years and older is 75 mg orally once daily (one 75 mg capsule once daily) for at least 10 days following close contact with an infected individual and up to 6 weeks during a community outbreak. In immunocompromised patients, oseltamivir phosphate capsules may be continued for up to 12 weeks [see Use in Specific Populations (8.9)]. The duration of protection lasts for as long as oseltamivir phosphate capsules dosing is continued. Pediatric Patients (1 year to 12 years of age) Table 1 displays the recommended oral dosage of oseltamivir phosphate for prophylaxis of influenza in pediatric patients 1 year to 12 years of age based on body weight and provides information about prescribing the capsule or the formulation for oral suspension. Prophylaxis in pediatric patients is recommended for 10 days following close contact with an infected individual and up to 6 weeks during a community outbreak [ see Use in Specific Populations (8.4) and Clinical Studies (14.2)]. Table 1 Oseltamivir Phosphate Dosage Recommendations in Pediatric Patients for Treatment and Prophylaxis of Influenza Weight Treatment Dosage for 5 days Prophylaxis Dosage for 10 days* Volume of Oral Suspension (6 mg/mL) for each Dose † Number of Bottles of Oral Suspension to Dispense Number of Capsules to Dispense (Strength) ‡ Patients from 2 Weeks to less than 1 Year of Age Any weight 3 mg/kg twice daily Not applicable 0.5 mL/kg § 1 bottle Not applicable Patients 1 to 12 Years of Age Based on Body Weight 15 kg or less 30 mg twice daily 30 mg once daily 5 mL 1 bottle 10 Capsules (30 mg) 15.1 kg to 23 kg 45 mg twice daily 45 mg once daily 7.5 mL 2 bottles 10 Capsules (45 mg) 23.1 kg to 40 kg 60 mg twice daily 60 mg once daily 10 mL 2 bottles 20 Capsules (30 mg) 40.1 kg or more 75 mg twice daily 75 mg once daily 12.5 mL 3 bottles 10 Capsules (75 mg) * The recommended duration for post-exposure prophylaxis is 10 days and the recommended duration for community outbreak (seasonal/pre-exposure) prophylaxis is up to 6 weeks (or up to 12 weeks in immunocompromised patients). The amount supplied (e.g., number of bottles or capsules) for seasonal prophylaxis may be greater than for post-exposure prophylaxis. † Use an oral dosing dispensing device that measures the appropriate volume in mL with the oral suspension. ‡ Oseltamivir phosphate capsules for oral suspension is the preferred formulation for patients who cannot swallow capsules. § For patients less than 1 year of age, provide an appropriate dosing device that can accurately measure and administer small volumes. 2.4 Dosage in Patients with Renal Impairment Table 2 displays the dosage recommendations for the treatment and prophylaxis of influenza in adults with various stages of renal impairment (estimated creatinine clearance of less than or equal to 90 mL per minute). Dosage modifications are recommended in adults with an estimated creatinine clearance less than or equal to 60 mL per minute [ see Use in Specific Population (8.6) and Clinical Pharmacology (12.3)]. Table 2 Recommended Dosage Modifications for Treatment and Prophylaxis of Influenza in Adults with Renal Impairment or End Stage Renal Disease (ESRD) on Dialysis Renal Impairment (Creatinine Clearance) Recommended Treatment Regimen* Recommended Prophylaxis Regimen*† Mild (>60-90 mL/minute) 75 mg twice daily for 5 days 75 mg once daily Moderate (>30-60 mL/minute) 30 mg twice daily for 5 days 30 mg once daily Severe (>10-30 mL/minute) 30 mg once daily for 5 days 30 mg every other day ESRD Patients on Hemodialysis (≤ 10 mL/minute) 30 mg immediately and then 30 mg after every hemodialysis cycle (treatment duration not to exceed 5 days) 30 mg immediately and then 30 mg after alternate hemodialysis cycles ESRD Patients on Continuous Ambulatory Peritoneal Dialysis‡ (≤10 mL/minute) A single 30 mg dose administered immediately 30 mg immediately and then 30 mg once weekly ESRD Patients not on Dialysis Oseltamivir phosphateis not recommended Oseltamivir phosphate is not recommended * Capsules or oral suspension can be used for 30 mg dosing. † The recommended duration for post-exposure prophylaxis is at least 10 days and the recommended duration for community outbreak (seasonal/pre-exposure) prophylaxis is up to 6 weeks (or up to 12 weeks in immunocompromised patients). ‡ Data derived from studies in continuous ambulatory peritoneal dialysis (CAPD) patients. 2.6 Emergency Preparation of Oral Suspension from 75 mg Oseltamivir Phosphate Capsules The following directions are provided for use only during emergency situations and when FDA-approved, commercially manufactured oseltamivir phosphate for oral suspension is not available from wholesalers or the manufacturer. The following emergency preparation instructions will provide one patient with enough oseltamivir phosphate capsules for a 5-day course of treatment of influenza or a 10-day course of prophylaxis of influenza: Step #1: Determine the dosage of oseltamivir phosphate capsules for the patient [see Dosage and Administration (2.2, 2.3, and 2.4 )] then determine the total volume of oral suspension needed to be prepared (see Table 3). Table 3 Emergency Preparation: Volume of Prepared Oral Suspension (6 mg per mL) Based Upon Oseltamivir Phosphate Capsules Dose Oseltamivir Phosphate Capsules Dose* Total Volume to Prepare per Patient 15 mg or less 37.5 mL 30 mg 75 mL 45 mg 100 mL 60 mg 125 mL 75 mg 150 mL * If the oseltamivir phosphate capsules dose is between the doses listed, use the greater listed dose to determine the total volume of prepared oral suspension. Step #2: Preparation must be performed with only one of the following vehicles (other vehicles have not been studied): Cherry Syrup (Humco®), Ora-Sweet® SF (sugar-free) (Paddock Laboratories), or simple syrup. Determine the number of capsules and the amount of water and vehicle needed to prepare the total volume (see Table 3) of prepared oral suspension (6 mg per mL) for a complete treatment or prophylaxis course (see Table 4). Table 4 Emergency Preparation: Number of Oseltamivir Phosphate 75 mg Capsules and Amount of Water and Vehicle Needed to Prepare the Total Volume of a Prepared Oral Suspension (6 mg per mL) Total Volume of Prepared Oral Suspension 37.5 mL 75 mL 100 mL 125 mL 150 mL Number of Oseltamivir Phosphate 75 mg Capsules (Total Strength)* 3 (225 mg) 6 (450 mg) 8 (600 mg) 10 (750 mg) 12 (900 mg) Amount of Water 2.5 mL 5 mL 7 mL 8 mL 10 mL Volume of Vehicle Cherry Syrup (Humco ® ) OR Ora-Sweet ® SF (Paddock Laboratories) OR simple syrup 34.5 mL 69 mL 91 mL 115 mL 137 mL *Includes overage to ensure all doses can be delivered Step #3 : Follow the instructions below for preparing the 75 mg oseltamivir phosphate capsules to produce the oral suspension (6 mg per mL): a. Place the specified amount of water into a polyethyleneterephthalate (PET) or glass bottle (see Table 4). Constitution in other bottle types is not recommended because there is no stability data with other bottle types. b. Carefully separate the capsule body and cap and pour the contents of the required number of oseltamivir phosphate 75 mg capsules into the PET or glass bottle. c. Gently swirl the suspension to ensure adequate wetting of the oseltamivir phosphate powder for at least 2 minutes. d. Slowly add the specified amount of vehicle to the bottle. e. Close the bottle using a child-resistant cap and shake well for 30 seconds to completely dissolve the active drug and to ensure homogeneous distribution of the dissolved drug in the resulting suspension. The active drug, oseltamivir phosphate, readily dissolves in the specified vehicles. The suspension is caused by inert ingredients of oseltamivir phosphate capsules which are insoluble in these vehicles. f. Put an ancillary label on the bottle indicating “Shake Well Before Use.” g. Instruct the parent or caregiver that any unused suspension remaining in the bottle following completion of therapy must be discarded by either affixing an ancillary label to the bottle or adding a statement to the pharmacy label instructions. h. Place a pharmacy label on the bottle that includes the patient’s name, dosing instructions, drug name and any other required information to be in compliance with all State and Federal Pharmacy Regulations. Place an appropriate expiration date on the label according to storage conditions below. i. Include the recommended dosage on the pharmacy label as per Tables 1 and 2 [see Dosage and Administration (2.2, 2.3, and 2.4)]. j. Store the prepared oral suspension in glass or PET bottles either: • In a refrigerator [2o to 8oC (36° to 46°F)]: Stable for 5 weeks when stored in a refrigerator. • At room temperature [25oC (77°F)]: Stable for 5 days when stored at room temperature.",
      "frequency": "As prescribed",
      "duration": "As prescribed",
      "quantity": 10,
      "prescribed_at": "2025-06-04T13:38:26.380353",
      "status": "pending"
    },
    {
      "id": "16ae657d-9a4f-4ad6-8366-8919bc5c3768",
      "medication": "Leflunomide",
      "dosage": "\"2 DOSAGE AND ADMINISTRATION Loading dosage for patients at low risk for leflunomide -associated hepatotoxicity and leflunomide -associated myelosuppression: 100 mg daily for 3 days. ( 2.1 ) Maintenance dosage: 20 mg daily. ( 2.1 ) Maximum recommended daily dosage: 20 mg once daily. ( 2.1 ) If 20 mg once daily is not tolerated, may decrease dosage to 10 mg once daily. ( 2.1 ) Screen patients for active and latent tuberculosis, pregnancy test (females), blood pressure, and laboratory tests before starting leflunomide tablets.( 2.2 ) 2.1 Recommended Dosage The recommended dosage of Leflunomide is 20 mg once daily. Treatment may be initiated with or without a loading dose, depending upon the patient's risk of leflunomide -associated hepatotoxicity and leflunomide associated myelosuppression. The loading dosage provides steady-state concentrations more rapidly. For patients who are at low risk for leflunomide-associated hepatotoxicity and leflunomide-associated myelosuppression the recommended leflunomide loading dosage is 100 mg once daily for 3 days. Subsequently administer 20 mg once daily. For patients at high risk for leflunomide-associated hepatotoxicity (e.g., those taking concomitant methotrexate) or leflunomide-associated myelosuppression (e.g., patients taking concomitant immunosuppressants), the recommended leflunomide dosage is 20 mg once daily without a loading dose [see Warnings and Precautions ( 5.2 , 5.4 )]. The maximum recommended daily dosage is 20 mg once per day. Consider dosage reduction to 10 mg once daily for patients who are not able to tolerate 20 mg daily (i.e., for patients who experience any adverse events listed in Table 1). Monitor patients carefully after dosage reduction and after stopping therapy with leflunomide, since the active metabolite of leflunomide, teriflunomide, is slowly eliminated from the plasma [see Clinical Pharmacology (12.3) ]. After stopping leflunomide treatment, an accelerated drug elimination procedure is recommended to reduce the plasma concentrations of the active metabolite, teriflunomide [see Warnings and Precautions (5.3) ]. Without use of an accelerated drug elimination procedure, it may take up to 2 years to reach undetectable plasma teriflunomide concentrations after stopping leflunomide [see Clinical Pharmacology (12.3) ]. 2.2 Evaluation and Testing Prior to Starting leflunomide tablets Prior to starting leflunomide treatment the following evaluations and tests are recommended: Evaluate patients for active tuberculosis and screen patients for latent tuberculosis infection [see Warnings and Precautions (5.4) ] Laboratory tests including serum alanine aminotransferase (ALT); and white blood cell, hemoglobin or hematocrit, and platelet counts [see Warnings and Precautions ( 5.2 , 5.4 )] For females of reproductive potential, pregnancy testing [see Warnings and Precautions (5.1) ] Check blood pressure [see Warnings and Precautions (5.10) ]\"",
      "frequency": "As prescribed",
      "duration": "As prescribed",
      "quantity": 10,
      "prescribed_at": "2025-06-04T13:38:26.383679",
      "status": "pending"
    }
  ],
  "allergies": [],
  "conditions": [],
  "created_at": "2025-06-04T13:38:25.709787",
  "updated_at": "2025-06-04T13:38:26.383690",
  "symptom_history": [
    {
      "symptoms": [
        "depression",
        "nausea",
        "vomiting",
        "fatigue",
        "shortness of breath",
        "chills",
        "body ache",
        "congestion",
        "chest pain",
        "sore throat"
      ],
      "recorded_at": "2025-06-04T13:38:25.713048"
    }
  ]
}